{"review_id":"jpRNEmdwP-FACj5xYSUSiA","user_id":"eXTu7IsDSxe0nEuZz4W7vg","business_id":"Ub8NRwZrsDC4thMrJrR7FA","stars":1,"text":"It is noisy, the food is not that hot and, the service is even worse! I will never set foot inside their door again.","date":"2011-04-22 04:06:28","vector":[0.0,0.0,0.0,0.0,0.0]}
{"review_id":"oqgYo5kIfBzc_wccCaTnng","user_id":"cLwhrakjY_SkEGNzbroIMw","business_id":"Ub8NRwZrsDC4thMrJrR7FA","stars":5,"text":"Absolutely love this place! For years I came here when champs becomes a bar so I didn't get to experience their food selection. That was until my 10 year old cousin and I went to lunch here. The food was amazing for both pallets. The staff is very friendly, and fun. I would suggest coming here for both food and partying!","date":"2011-12-01 16:15:13","vector":[0.0,0.0,0.7579,0.3358,0.0]}
{"review_id":"7ax-t97_th0rP9BpgvvZhQ","user_id":"H7w3rkkWKzgSMJ3e6mRXgQ","business_id":"Ub8NRwZrsDC4thMrJrR7FA","stars":1,"text":"Worst customer service. NOTE happy hour specials for food can ONLY be ordered if u sit in the bar area - they won't tell you this before hand and will seat you where ever. Don't even try to voice your opinions to a manager, all you will get is excuses. The customer is always right, rule number one of customer service.","date":"2011-05-28 01:48:38","vector":[0.5719,0.0,0.0,0.5719,0.0]}
{"review_id":"u2yvu1KCELtfOTlbfH0i5g","user_id":"VFp9AYShu_C9T4QsHpM3yA","business_id":"1aj82SfdQQQ2Bic-4mbAhg","stars":2,"text":"Not so good anymore; not fresh and sort of blackened.  Ugh.","date":"2011-05-31 04:30:23","vector":[0,0,0,0,0]}
{"review_id":"hk4K69J47h7zXMMyzqXmKw","user_id":"c9-jEIfBnLa4iNHxVmXAHA","business_id":"Ub8NRwZrsDC4thMrJrR7FA","stars":1,"text":"No no no no no no no.....NO.\n\nI'm not impressed by any means. \n\nThe place is overrun with \" 'Bro-ster's\" and makes having an enjoyable night very hard when trying to order a drink and having to weave through popped collars, bad hair styles and greasy skin. \n\nAs far as the women clientele? Can you answer a question without looking like a moron? \n\nI swear, if the girls here weren't pretty, they would be homeless.","date":"2008-08-24 22:00:41","vector":[0,0,0,0,0]}
{"review_id":"22PMW0a916jwOsEg_edvpg","user_id":"0t-O5--DOfS55A620fO_GA","business_id":"Ub8NRwZrsDC4thMrJrR7FA","stars":3,"text":"Don't eat here unless you are drunk and don't mind crappy bar food. Seriously.  There are much better places to eat food in Tucson........There are better reasons to go here besides food.  First, there are many TVs and almost every seat in the establishment offers an opportunity to watch the game.  Second, you must try a \"Trash Can\".  These things are great!  Just order one.............Yeah, so, go here to drink and watch sporting events.  The crowd is fun, the drinks are cold, and there are TVs.  Yesssss!","date":"2010-11-30 06:30:00","vector":[0.1312,0.0,0.0,0.0,0.0]}
{"review_id":"rf0jTJwxUY82qf9akrp07g","user_id":"VFp9AYShu_C9T4QsHpM3yA","business_id":"1aj82SfdQQQ2Bic-4mbAhg","stars":5,"text":"One of the best noodle bowls I have ever had.  Don't worry about getting a two or three-item combo. Get the one-item noodle bowl.  Thick udon noodles sort of like lo mein, veggies including broccoli, carrots, and cabbage, and hibachi-grilled teriyaki chicken.  It is so delicious.  And yep, it's inside the Tucson Mall.  I can't even explain how great the textures and flavors are.  I definitely recommend for an amazing $6 meal.","date":"2010-12-08 05:59:00","vector":[0.0707666667,0.0,0.0,0.0,0.0]}
{"review_id":"Xr-ryGC7Wr-lCepaDqwJlA","user_id":"T-7AzxQMocOW0FdmDY5tnw","business_id":"1aj82SfdQQQ2Bic-4mbAhg","stars":3,"text":"It was ok even tho I did take out on a hibachi grill and their we no people inside, food was fresh and tasted well.","date":"2012-09-28 14:32:37","vector":[0.296,0.0,0.0,0.0,0.0]}
{"review_id":"ataxe24zGBFX_7QerDH3Ww","user_id":"_ADnCcFfZrKuCUdv2SD-PA","business_id":"1aj82SfdQQQ2Bic-4mbAhg","stars":4,"text":"hit the spot soooooo good! their teriyaki chicken is bomb. reminds me of home. my only complaint was that i wanted an extra scoop of rice and it was going to cost me $3! highway robbery!!!","date":"2011-06-09 09:10:12","vector":[0.00255,0.0,0.0,0.0,0.0]}
{"review_id":"-VhvIEpMIEtu1a74EukFWw","user_id":"DbPkspjEn64RXQSdhdPw_A","business_id":"1aj82SfdQQQ2Bic-4mbAhg","stars":1,"text":"Was about to order and watched employee handling raw chicken then turned around and was gonna take my order- no gloves, no hand washing. Um, no thanks...","date":"2012-12-03 22:18:24","vector":[0.0,0.0,0.0,0.0,0.0]}
{"review_id":"aU8tQnFO-Wdbo325Ax7f1A","user_id":"XZxMgbZiaXuCTb0l--RoUg","business_id":"ctHjyadbDQAtUFfkcAFEHw","stars":5,"text":"date night with girlfriend here was perfect. i wouldn't say im so much a foodie but i love to eat good food. 9:45 reservation, walked right to our table. exceptional service from start to finish. Jeff was our server he was great. we both did the 39$ plAn and we started with humus tahani and the most amazing phenomenal soft warm pita bread. next we each chose 2 small plates (fried broccoli, cucumber and yogurt, short rips and potatoes which melted in my mouth, and chicken pastilla!) they were perfect and filling. they also served us side mediterterannean salad items (carrots, zucchini, etc) lamb and beef kofte followed these. incredible and the most amazing flourless frozen almond chocolate cake and some kind of amazing ice cream.... well basically, im a 25 yeAr old student and it was a pleasure spending 122$ on a fantastic meal in an incredible atmosphere with a pretty ambiance with above average service. would most definitely recommend","date":"2014-04-19 12:20:39","vector":[0.1738375,0.3989333333,0.5719,0.3292666667,0.0]}
{"review_id":"9MFyPkP0wjHMyx18tlF3Pg","user_id":"nkBpODDjnP-nD9uz1Z4YsA","business_id":"ctHjyadbDQAtUFfkcAFEHw","stars":5,"text":"Can't say enough good things about Zahav! This restaurant is an amazing experience from start to finish. Tucked back behind a Rtiz Theatre and Positano Coast, this isn't a place that would normally would stand out, but word has travelled far and wide that this is a must try restaurant in Philly at this point. \n\nWe went in two of the last three years for my wife's birthday and couldn't have left happier. They do every aspect of a restaurant experience right. The servers are all really friendly, and explain what every item is for those of us who's only experience with Israeli food is Zahav. The bartenders treat you like family and take great care of you when dining at the bar. Chris, who was waiting on us from behind the bar last night, was tremendous. He explained everything in great detail, took my wife's dietary restrictions and immediately pointed out three things we'd want to avoid on the menu, and took my love for Bluecoat Gin and instantly had a drink in mind for me, which was delicious. Plus, he was good to chat with for the very short period between courses. \n\nThe food is all so different from what I'm used to, but I am yet to try something here that I didn't love. For example, I've never eaten hummus (I know, not that scary) other than the two visits I've had to Zahav (it's a choice I've made, also won't touch tofu or turkey bacon for example), but when I'm here I'll go for it and it's just delightful. When you consider the fact that when you order the tasting with another person you are going to eat literally about 20 different items in that sitting. There should be something that completely grosses you out, but it just doesn't happen for some reason. You sit there wondering if there could be anyone there not loving their experience. It's that good. \n\nSome things I loved:\n-The hummus, both their traditional tahina and the warm Turkish. Delicious with that bread fresh out of the oven. \n-The crispy grape leaves. Never enjoyed one as much as these. Nice little kick of heat in them as well.\n-The grilled Haloumi. This cheese, if you haven't tried it, is a game changer. I honestly didn't even realize it was a cheese when I ordered it, but then instantly remembered the last place I had it, which was Kanella, as soon as I bit into it. So good.\n-The fried potato. Super crispy. Super delicious. \n-The branzino. The fish has a perfectly crispy skin on top, great flavor, and the tzatziki just adds to it. \n\nIf you like trying different foods and thinking spending a little extra for a perfect dining experience is worth it, this is somewhere you want to be.","date":"2015-12-05 15:05:04","vector":[0.2971291667,0.6369,0.0,0.10415,0.146475]}
{"review_id":"939yCAYbEWUwoG8BHyskrQ","user_id":"FC1ZSB9fd4WlDMSAbEjq8Q","business_id":"ctHjyadbDQAtUFfkcAFEHw","stars":5,"text":"As a foodie, I spend a lot of time researching places to eat whenever I visit new cities. I did a last minute trip to Philly and did not really have time to do extensive research. Shame on me.\nLuckily, my friends told me about Zahav as I was riding the Amtrak to Philly. I immediately went on OpenTable to book a seat for 1. Surely I could get a table for 1. Well.. nope. The restaurant was full. I looked at a bunch of Yelp reviews and learned that you had to book this restaurant 3 months in advance.  \nWell, I decided to walk in and try my luck. After all, Anthony Bourdain did eat here and it is one of my life goals to eat at all the restaurants that he has eaten at.\nAs soon as I checked into my hotel, I wasted no time in heading to Zahav. I got to the restaurant around 6:30pm and saw a lot of people waiting. Oh no... would I have to wait too? Well, the host led me straight to the bar where there was an open seat. I felt as if I had just won the jackpot!\nI settled in my seat and ordered a glass of wine. The bartender that took care of me was absolutely fantastic! I was sitting next to some awkward dude who was eating alone, and we happened to order the same thing. He happened to order before me so his food would come out first, then mine would come out 10 min later, and they were quite similar. I promise I wasn't copying him!\nI've never had Israeli cousins before, the only thing I knew was that I would not eat pork. That was the extent of my knowledge. The bartender suggested that I do the \"taste of zahav\", which consists of a 4 course meal, with multiple dishes in each course. He suggested that I should take it easy on the appetizers, so that I could focus on eating the main course. After all, the appetizers were  easily packable to bring home. The course cost $48, and is a great way to taste everything. You can also do wine paring for an additional $36. Let's dive into each course:\nCourse #1: salatim & hummus with laffa. Salatim means salads- you get 6 different small salads such as cabbage salad, eggplant salad, green bean salad etc. These were good. The hummus was amazing, there are 3 types to choose from. I had the daily hummus, which had some chicken in it. The bread that comes with the hummus is AMAZING. I almost died. It was so soft and pillowy and fluffy.... Yum. I had a really hard time not eating the whole bread, because I needed to save space for the rest of the courses. \nCourse #2: 2 mezze. You can pick 2 small dishes from the menu. I picked the fried cauliflower and haloumi. The dark hearts are quite a popular dish, the guy next to me had it... I am not a fan of eating hearts but if you like hearts, I hear its good here. Both dishes were good. The haloumi was amazing, it came with blueberries and pistachio, which sounds like a weird combination, but actually tasted fantastic. \nCourse #3: Al Ha'esh- grilled dish over coals. I had the grilled branzino. To be honest, I was quite full at this point but ate the whole thing. The skin was nice and crispy, the fish was soft and tender.\nCourse #4: Desert. I had grilled peach with sherbert, and za'atar shortbread.  The shortbread had a nice twice to it, it tasted different from Walkers' shortbread. \nThe waiter packed all my leftovers for me in separate containers... which I ate that night before going to bed. \nI had a wonderful experience here and can't wait to come back. Remember, if you walk in by yourself, you might score a seat at the bar with minimal wait! Or else, make your reservation exactly 3 months in advance!","date":"2018-09-14 14:25:32","vector":[0.1000384615,0.1646333333,0.24835,0.1028857143,0.0]}
{"review_id":"Fi-fRDDSrEIppbSC75iYqg","user_id":"YCIIVcEdGB1MxRH0FfHc3g","business_id":"ctHjyadbDQAtUFfkcAFEHw","stars":5,"text":"I think about that Vanessa Carlton line: \"you know I'd walk a thousand miles...\" After I booked my recent trip to Philly the next thing I did was to book this restaurant. What an amazing place! Spectacular food and service. The lamb shoulder with pomegranates and chickpeas is indescribably delicious and I will never forget that first mouthful. Fanatical, yes but go and you will understand.","date":"2014-10-11 14:46:36","vector":[0.1906333333,0.0,0.0,0.0,0.0]}
{"review_id":"ToTMuvRe_l01iSEMSfxLCA","user_id":"cR5bvpc0xeQpm-Bsx67A8w","business_id":"ctHjyadbDQAtUFfkcAFEHw","stars":5,"text":"Like another reviewer, I had been a bit underwhelmed by my past RW weeks-rushed in and out of places like Butcher & Singer, eating off very limited menus, slow service, etc, etc.  I went for lunch with a friend at Zahav for restaurant week and the experience could not have been better. \n\nFor one, the service was fantastic. My friend and I are both students, and normally are given crappy service as a result. At Zahav, the waiter could not have been more patient, explaining each menu item and its flavors. The owner came over in the middle of our meal to ask how it was going as well as at the end of the meal to make sure we had had a great meal. Our meal was the definition of relaxed comfort-I described the atmosphere to one of my friends as 'like a neighborhood place'.\n\nIn terms of highlights, the salatim definitely stands out as a can't miss; a large selection of tasty small dishes. There wasn't a bad dish among the ones we had, each unique and full of flavor. My friend basically devoured the hummus, so I have to assume it was good. The potato latke with salmon was also great; it's the kind of dish that you're sad when it's over because it was that good. The duck kebab kind of looked like a 'duck hamburger' in a small patty; I didn't taste the pistachios in it but it still tasted great.\n\nPerhaps the only not amazing part (of which the service more than makes up for) was the dessert. The pistachio cookie of my caramel semifreddo was very tough, although the flavors were good. my friend had the baklava and didn't like it as much as the regular dishes. \n\nAll in all, I would gladly pay non-RW prices; it was a fantastic experience and I can't wait to come back soon.","date":"2012-02-01 03:44:12","vector":[0.093132,0.1806,0.25,0.0,0.24695]}
{"review_id":"P4g8enpcUsMoX9JAAOqHUw","user_id":"3MYdpmHeNwC6FquRWi3YOg","business_id":"ck8x9kfSJ4Okj2fz0_UDlQ","stars":4,"text":"The best turnout of Too Cool for Tuesday so far was at Kyo Sushi.  I had sashimi and a soft shell crab roll and it was decent, medium portions.  What makes the place very good I think is the location, closest sushi place to where I work.  It's in Rita Ranch by the Safeway there.","date":"2005-10-26 03:05:11","vector":[0.0,0.0,0.0,0.0,0.0]}
{"review_id":"s10C9P1iJNsOq87VFWTByQ","user_id":"rlEApmZAbUkn2JXkd6Bmvw","business_id":"ck8x9kfSJ4Okj2fz0_UDlQ","stars":5,"text":"5 stars is for the Vietnamese food. I can't speak to the sushi or the Chinese food as I have not ordered it, nor am I interested in it when I know the Vietnamese food here is the best!\n\nThe pho here is amazing, and huge! I have never been able to finish a bowl on my own. It got to the point where my husband and I would just order one bowl so that we could just share. The cool thing is the waitress that works there gave us little bowls along with the huge bowl of pho so we could use them to split the bowl.\n\nI wouldn't recommend coming here with a large group unless you are willing to wait a while. There is usually only ONE waitress. We brought a huge group once, and I just felt so terrible for her, because it so happened that day was incredibly busy without our group being there.\n\nAnyway, get the pho when you come here. Actually, get any of the Vietnamese food and you won't be disappointed. Boba tea is great here, and if you want an appetizer, I definitely recommend the spicy chicken wings. They are to die for.","date":"2011-05-03 01:06:46","vector":[0.2782444444,0.0,0.0,0.3182,0.0]}
{"review_id":"A6XDiJqJhy5Rwz7qZiX5wQ","user_id":"b8TPUD4OjwooNgq2qpbYHw","business_id":"ck8x9kfSJ4Okj2fz0_UDlQ","stars":1,"text":"Owner change + chef change = completely awful sushi now.  Expired fish and poorly made rolls.  I gave it 3 chances even after the change (I'm WAY more forgiving than most people I think) and it disappointed each time.  Go drive to Sushi King on Ft. Lowell and Campbell and you'll get better sushi than a lot of places in Los Angeles.  It's worth it to avoid this place.","date":"2009-02-03 23:49:02","vector":[-0.0230333333,0.0,0.0,-0.296,0.0]}
{"review_id":"O7bH51IfjPMKabHLsVZMhA","user_id":"b8TPUD4OjwooNgq2qpbYHw","business_id":"ck8x9kfSJ4Okj2fz0_UDlQ","stars":3,"text":"Kyo is a blessing for the South-East area of Tucson.  We are pretty neglected over here and to have a sushi-ya in it is fantastic!\n\nThe chef is a bit deaf in his right ear, so speak up if you want his attention.  He's a chatty fellow if you catch him during a slow time.  He worked somewhere in New York before here in Tucson.  He lives in Rita Ranch and walks to work as he does not have a driver's license!\n\nKyo is owned by the same owner that owns the next door Chinese Combo place.  And while this might scare the typical sushi afficiando, I challenge you to seperate that concern if you have it.  The sushi here is good and deserving of a visit.  His saba\/mackerel is always good.  He also heats up his unagi\/fresh water eel at a higher temperature than most others.  I think it does wonders for the experience.\n\nHe doesn't make his own tamago tho, he says he's stuck with the wrong tools as he has to share his kitchen with the other restaurant next door, and it's primarily chinese utensils\/cookware and he doesn't have the proper pan for it.  I'm tempted to buy him a few pans just to see what he can do since he's so good with the rest of it all.\n\nHe sometimes makes a \"Japanese Bagel\" which is a single piece of maki-zushi style where there is smoked salmon, cream cheese and crab rolled up together.  I fancy myself as dubbing the name for his creation as I equated it to such when I first ate there.  He laughed heartily at the name and I come to find out he calls it such still as I went a few weeks ago or so and he apparently calls it such today.\n\nI'm still not sure of his name, I need to get him to write it down someday.  But I refer to him as Yama-san and I know that's part of his name and it's also a respectful elder reference used in Japan so I think he takes to the name well.\n\nI think the rice here isn't perfect, but it's good enough.  Usually not as moist\/tender as I want.  But not bad either.  I tend to avoid tempura\/deep fried maki-zushi here as it tends to be a bit oily and overheated.  Otherwise, the rest of what he offers in the sushi\/bar scene seems to be very fresh and very well made.\n\nI always enjoy my sushi here.  My friends have a tendency to be a bit disappointed with the kitchen food.  Service tends to be slow with only one helper even at peak times usually.  But I'm almost always willing to overlook all this as I'm a sucker for sushi.","date":"2006-12-30 06:59:38","vector":[-0.0110190476,0.0,0.0,0.0986666667,0.0]}
{"review_id":"n0KhSiRBvLlMOVA6oYt0qg","user_id":"36Dq7dz7-VIshoHr3AC35Q","business_id":"ck8x9kfSJ4Okj2fz0_UDlQ","stars":1,"text":"Not impressed. I ordered pho and thought it was disgusting. I had never had it before so I could just dislike that type of food. My fiancé and I both love sushi so he decided to order some rolls. He said that they were not that great. Not bad but not a place we would try again. At least not for pho or sushi.","date":"2013-08-25 06:38:46","vector":[0.31845,0.0,0.0,0.0,0.0]}
{"review_id":"9lrbxoSW6NvPCUmrLig2XQ","user_id":"mfwLTj4kxIfRzOBIsuheHA","business_id":"ZrkPvgCKxS_vBhYr8l-ZXw","stars":4,"text":"I like their donuts. Good fried rice, good other stuff. Docked a point because the egg foo young gravy is terrible. Like, the worst egg foo young gravy possible. Gel. Just order other stuff.","date":"2015-02-06 00:50:09","vector":[-0.04416,0.0,0.0,0.0,0.0]}
{"review_id":"9t_QwYcn_XPSQ4--6W5-qA","user_id":"0oTAftklxtL4iHsd-GiOZA","business_id":"ZrkPvgCKxS_vBhYr8l-ZXw","stars":3,"text":"I ordered delivery- large General Tso's with white rice. The sauce was so sweet I think it's sweet and sour sauce or something. I wish there was a better chicken to broccoli ratio. White rice was perfect. Delivery was super fast and customer service was great. 3 stars because I didn't have to get out of my jammies to have dinner.","date":"2015-05-03 02:35:07","vector":[0.29882,0.5994,0.0,0.0,0.0]}
{"review_id":"pmc0xb5NKTRz2avVT_K9oA","user_id":"KetTry3F8esIcE-jIU5sMQ","business_id":"ZrkPvgCKxS_vBhYr8l-ZXw","stars":2,"text":"Cash only, food was only OK at best. \n\nNo seating, takeout only. \n\nI had beef with broccoli and fried dumplings. Beef was a little Chewy and not a lot of flavor. Dumplings were too doughy and tasted like they were reheated. Egg rolls weren't too bad and the rice was just OK\n\nYou can do better around here and I would suggest you do.","date":"2013-03-16 23:49:47","vector":[-0.0859888889,0.0,0.0,0.0,0.0]}
{"review_id":"f40kR9fs7C6rlfKLzGaX5A","user_id":"Y2ShLn_gdJrpV3LD-ln_nw","business_id":"ZrkPvgCKxS_vBhYr8l-ZXw","stars":4,"text":"Today's lunch special devours comes from King Food; deep in the corner of south Philly. This small Establishment has been there for years and I just so happen to know and teach the children of the family that runs this establishment.  Today, I decided to finally try them out. I ordered the six dollar lunch special general tso chicken with chicken fried rice and fresh vegetables. The general TSO chicken was cooked and fried to perfection. The chicken wasn't too hard or too chewy as some neighborhood Chinese stores are known for. Fried rice was very fresh and the vegetables with them for rice with a fresh along with the chicken. The broccoli was also super fresh. And they also deliver and they're really great people. If you ever find yourself near 95 I want some cheap fulfilling food, please visit King Food and seriously tell them that I sent you because they know me by first and last name ‍ #chinese #chinesefood #broccoli #rice #chicken #vegetables #lunch #teacher #students #family #philadelphia #philly #food #foodie #foodphotography #foodies #foodporn #foodgasm","date":"2019-10-03 22:36:28","vector":[0.2565214286,0.0,0.4019,0.5719,0.0]}
{"review_id":"SgKbPUnleHjQmVk_NwqAqw","user_id":"Sc7VLDyE_fw2Ya9-P_GSGg","business_id":"ZrkPvgCKxS_vBhYr8l-ZXw","stars":5,"text":"Super fast, their orange chicken and general tso's is delicious.","date":"2014-10-09 17:56:12","vector":[0.5994,0.0,0.0,0.0,0.0]}
{"review_id":"BPq7pOaFkqSw68tV6OUoQg","user_id":"yG_vfdH6k4hb62bPPHbD8Q","business_id":"3NFn0dM9U2K_64vp_qEIug","stars":5,"text":"I can't recommend this shop enough! An excellent selection of soaps, scrubs, lotions and body oils. I don't think I've smelled anything more intoxicating than the Saguaro Blossom cream -- definitely a must-try! Thankfully the shop on the website is easy to use, so I can stock up from afar.","date":"2020-01-15 16:55:40","vector":[0.24345,0.0,0.0,0.4215,0.0]}
{"review_id":"YFoqKgWPxp4QWf3gPdWulA","user_id":"LbYa0LujdDp7Me8DOIUGfg","business_id":"3NFn0dM9U2K_64vp_qEIug","stars":5,"text":"Wow I LOVE this store! Miss Tracy makes all the soaps herself, she mixes lotions and body sprays on site and will help you make a custom salt scrub. She's so knowledgeable too, we asked her which oils would be best for migraines and fibromyalgia; miss Tracy whipped out her essential oil bible and had all the answers.","date":"2019-11-27 22:51:04","vector":[0.0,0.0,0.0,0.0,0.0]}
{"review_id":"AzIRSdAlNZword0iZd5Dqw","user_id":"MmTxP-62X0pSmBbpgv1bIw","business_id":"3NFn0dM9U2K_64vp_qEIug","stars":5,"text":"Loved visiting this happy clean place.  I was warmly greeted by the owner who helped me to create my own scent body spray using essential oils.  This elegant and earthy place offers healthy and eco-friendly beauty products for every one at any age.  Don't be fooled by the high-end appearance, the Prices ar","date":"2018-08-22 21:13:25","vector":[0.3796666667,0.0,0.0,0.0,0.0]}
{"review_id":"6QJJJxu1cXMCyv2V99a4Jg","user_id":"9jG_IY3Qy1Hfy929HzakVQ","business_id":"3NFn0dM9U2K_64vp_qEIug","stars":5,"text":"Great soaps, lotions, body butters, scrubs and service! I stopped in here one morning & the owner helped me discover her MANY wonderful products. I bought lots of body butters and scrubs because I swim year round. Her many soap scents are wonderful to choose from. Highly recommend.","date":"2018-10-17 19:35:44","vector":[0.2992,0.0,0.0,0.0,0.0]}
{"review_id":"okB3cb_CGoIIILGMepNOvg","user_id":"XF32UzckBSWLeLTMrbTyXQ","business_id":"3NFn0dM9U2K_64vp_qEIug","stars":5,"text":"Found this gem on Yelp and decided to pay Ms. Tracy a visit! I'm so glad we did! The store smells amazing and from the minute you step inside you feel a calmness. The scents are heavenly and I can't wait to get home tomorrow and try out my haul! I will definitely update once I have tried the products.","date":"2021-09-18 23:15:25","vector":[0.0,0.0,0.0,0.0,0.0]}
{"review_id":"D7y-4f1W8S7JS8nLbURaUg","user_id":"zE7NWcZjczNRXetVvOOkyg","business_id":"dbRL4wqgFThGf9Q76wweTg","stars":5,"text":"I've used this UPS store a couple times. Their prices are reasonable, and the staff is quick to engage you, and efficient to complete whatever you need done.","date":"2017-08-29 23:41:52","vector":[0.0,0.0,0.0,0.0,0.0]}
{"review_id":"5Shwib_9R0zSKc6PNRUMig","user_id":"AkZXxm6Y5C-KXu52B2Tklg","business_id":"dbRL4wqgFThGf9Q76wweTg","stars":4,"text":"Friendly people, fast service. \n\nIf you internet shop, eventually you are going to have to return something. This UPS store is great. They typically only need to take my package from me and I don't have to do anything. \n\nA couple of times, I did mail from this location because I wanted to be able to track to the minute (otherwise I like to support USPS). The friendly person at the register made it literally (hah!) fool-proof. \n\nParking can be annoying, but other than that, it's a perfectly good place to mail packages for decent prices.","date":"2012-03-11 00:55:05","vector":[0.0,0.0,0.0,0.7964,0.0]}
{"review_id":"u9fxiIY2Hr-P8ITGoVlehA","user_id":"wkFnCm4g4KqXxvNlbi1rEA","business_id":"dbRL4wqgFThGf9Q76wweTg","stars":4,"text":"Very convenient. Fast service. Friendly people. Easy parking. I wish the hours were longer, but most UPS stores are that way.","date":"2017-02-04 22:34:28","vector":[0.0,0.0,0.0,0.2202,0.0]}
{"review_id":"BtFIrtSK7MGna5MIXSs-pw","user_id":"6Jrx4sEzyYLz4XWAMVokgw","business_id":"dbRL4wqgFThGf9Q76wweTg","stars":5,"text":"I have been coming here a couple times a year to ship items for the past 8 years.\nEvery time I come in I am in and out within minutes. The staff here knows what they are doing and they are very efficient. \nThe staff is also very polite (asking me how my day is) and very courteous which added with their speed and professionalism makes it my fav ups store i know of.","date":"2013-09-18 22:14:15","vector":[0.0,0.0,0.0,0.0,0.0]}
{"review_id":"Y0rQhqndUa8hFvtzn0M3NQ","user_id":"h_YBvntSFvZgSfKfbPpTHg","business_id":"dbRL4wqgFThGf9Q76wweTg","stars":2,"text":"ok ....until the 1st time you make a claim [$150 on a $1200 shipment] NOT PBO either.","date":"2014-12-31 01:34:56","vector":[0.0,0.0,0.0,0.0,0.0]}
{"review_id":"luMk8e3xEDxL8LSdm6V-og","user_id":"gENQ4Uh3Adeg5tOEAfsW2A","business_id":"AAQ3g1ufbkOEuPg4JJ3YnQ","stars":4,"text":"Been here 2 times now and both times I've been impressed. Really fresh and delicious sushi. My favorite though is their hibachi which is a little odd but DELICIOUS. I always get shrimp and steak but sometimes switch it up. I don't really like a ton of sauce on my rolls so I usually ask for no sauce. The ambience is nice with a lot of seating. Location is in carol wood and parking lot can get full quickly. Definitely a great addition to the food scene in the area though.","date":"2018-07-07 21:35:16","vector":[0.2224666667,0.0,0.4201,0.1405,0.0]}
{"review_id":"aLoP3o5S-nc5DNLQX6uvoA","user_id":"jvMy6ph-5OikLSh14nZitQ","business_id":"AAQ3g1ufbkOEuPg4JJ3YnQ","stars":5,"text":"Best sushi experience we have had since moving to Tampa 8 mo's ago.  Ambiance is bright clean and inviting.  Service is very friendly and personable, and the food is fresh, tasty and craveable.  We will definitely be back and the sooner the better.  Highly recommended.","date":"2017-03-15 14:08:01","vector":[0.6369,0.5413,0.0,0.6808,0.0]}
{"review_id":"Cc0sqzDySc4BhsdkCIFn1g","user_id":"NtjoQwUeJKo87rbenWSQLw","business_id":"AAQ3g1ufbkOEuPg4JJ3YnQ","stars":5,"text":"Happy hour (2-4-1 Bud Lights and saki) and $3 and $5 rolls. I'm a sushi amateur but the Dynamite and American Idol rolls are delish. The kids, that are sushi pros, love everything else!","date":"2016-06-11 23:16:06","vector":[0.5719,0.0,0.0,0.0,0.0]}
{"review_id":"YEtlZneW21mEWWpDT5KxVA","user_id":"2rqy-iskFArj-yXGc_yiGA","business_id":"AAQ3g1ufbkOEuPg4JJ3YnQ","stars":5,"text":"This is such a cute place. Sushi was soooo good. Fresh and extremely tasty. They have a great happy hour and a great premium sushi roll menu.","date":"2018-06-09 18:35:58","vector":[0.5139333333,0.0,0.0,0.0,0.0]}
{"review_id":"KNOjWQrw3OvNUHm0soQKwA","user_id":"u4WuzwpJR7FydQZ1f9_P-w","business_id":"AAQ3g1ufbkOEuPg4JJ3YnQ","stars":4,"text":"So far, we came to the happy hour deals. Good fresh sushi and nice ambience. They need to improve on service.  But, would come back for more.","date":"2016-04-25 14:09:27","vector":[0.6369,0.4404,0.0,0.4215,0.0]}
{"review_id":"EsZcuUjRvNBjOLNR7gX8AQ","user_id":"inmWJhh3q-dd9CYsuuCHXA","business_id":"xJ3aziMabFEjF8X0kvPfLw","stars":3,"text":"Really just okay nothing special to write home about with this place ...a chain after all. Their corn muffins do have awfully large hard pieces of corn stuck in them which is pretty offputting but the rest of the baked goods  are fairly  high-quality.","date":"2013-08-15 16:04:32","vector":[-0.12952,0.0,0.0,0.0,0.0]}
{"review_id":"PvQMAtN-lDwARi2CfT7K_Q","user_id":"wXdbkFZsfDR7utJvbWElyA","business_id":"ayMyBuxLLifdptJd-FS4PA","stars":5,"text":"For anyone who is a fan of history, writing, and\/or life in Indiana, this home is a gold mine of information and cultural artifacts.  What makes this home different from so many other museums is that nearly all of the pieces (incl. furniture, carpeting, dishes, etc) are from the original owners of the house, not just period pieces assembled by some curator.\n\nThe opulence of the home is obvious and the home was a key player in social affairs in Indy late in the 1800's. The fact that the \"Hoosier Poet\" from the \"Golden Age\" of Hoosier literature lived in one place for nearly a quarter century at the height of his fame makes the stories about the place even richer.  The President of the United States (Harrison) dined here.  Mark Twain (Tom Sawyer), Booth Tarkington (Alice Adams & the Magnificent Ambersons), General Lew Wallace (Ben Hur) and numerous authors dined here.  Any given night might be an occasion for celebration.\n\nThe woodwork is stunning.  The baseboard is a foot high.  The doorways in the entry are about 12 feet high in rooms with 14 feet ceilings.  Detailed plaster surrounds the chandelier bases and marble fireplaces in nearly every room turn the functional pieces into artwork.\n\nIf you are planning on taking a group, make an inquiry to see if you can have a visit from \"Mr Riley\" who may read some of his more famous poems.  The actor was a former student of one of our group and we were really impressed with the passion and charm that the presentation added to the experience. \n\nCount on starting with a brief film to start the tour and then moving over to the house.  The only negatives of the tour are that no photographs are allowed inside (postcard photos are available at the end) and that you can only step into each room about three feet.  Although that doesn't allow too many folks to view at one time, our group of four managed to shuffle around and take turns without missing very much.\n\nParking is free on the north side of the street, so approaching from Park Avenue is ideal.\n\nThere are quite a few steep stairs to climb, so keep that in mind if you have difficulty climbing.\n\nReview #221","date":"2017-02-09 21:22:43","vector":[0.0,0.0,0.0,0.0,0.11988]}
{"review_id":"hpvyyT7hrzcDnZ1h1AWmwQ","user_id":"UE6e9sCOFW5qSzginRxmHw","business_id":"xJ3aziMabFEjF8X0kvPfLw","stars":3,"text":"I work near BRB, so I tend to come here fairly often. My favorite thing about ABP is that their medium-sized espresso drinks are only $1.99, which is way cheaper than anywhere else on campus. The staff tend to be very friendly, and the process is usually efficient. I'm less thrilled about their hot food. It tends to be a bit over-price and bland. However, overall it is definitely a better value than nearby options like Gia Pronto, and the staff seems happier.","date":"2015-06-21 00:04:20","vector":[0.2997333333,0.0,0.2635333333,0.0,0.3612]}
{"review_id":"rnauLy9PnlfWGjqG7SUKyg","user_id":"0a5rT64Hjq855B2W5eyb5w","business_id":"xJ3aziMabFEjF8X0kvPfLw","stars":5,"text":"The pastries are just soo good. Actually the ones I regularly get are so soo good. Creme de fleur and pecan rolls... Salads... not bad! Soups... like... morning blend coffee is my fix... just wish I was rich so I could afford  it every day. Them again not, as I already pay for gym too!! :)","date":"2010-08-30 03:06:08","vector":[0.0,0.0,0.0,-0.1027,0.0]}
{"review_id":"Gbh46yj2ofUzCRTL4lHr5Q","user_id":"Aiyg1g6mDe8J140P11U2uQ","business_id":"ayMyBuxLLifdptJd-FS4PA","stars":4,"text":"This is the place where history lives.  never had such a nice place like this with all the arts and antiques.","date":"2012-12-10 02:37:28","vector":[0.0,0.0,0.0,0.0,0.0]}
{"review_id":"dGswAgbUn25Jt4OPKtlqpA","user_id":"Fr-ZISqZLYP4Oh2dpFdZGw","business_id":"ayMyBuxLLifdptJd-FS4PA","stars":5,"text":"A super charming historic home tour! I loved seeing the desk where he wrote many of his poems. This was one of my very first historic home tours and probably what turned me into the addict I am today. When traveling - two things I just can't pass up - libraries and historic homes. Egads, what a nerd I am!","date":"2009-01-04 04:16:31","vector":[0.0,0.0,0.0,0.2997,0.0]}
{"review_id":"G63AOzswE8ozmdfMkCugCQ","user_id":"bbFbx9uyJ9dIyXk6rApLpw","business_id":"xJ3aziMabFEjF8X0kvPfLw","stars":3,"text":"I've been into Au Bon Pains plenty of times and I like the consistency.  The coffee is good and the baked items are good.  This review, however, will focus on the management, as I recently had an unpleasant experience at this particular location.\n\nThis Au Bon Pain has a large seating area, and as I work near by I like to stop in on my way home to take advantage of the baked item sale after 7 in the evening (the redvelvet cupacakes are DELISH!). Recently, while waiting for the sale to start, I was seated in the seating area and a disheveled african man (not being racist, only pointing this out to be descriptive) approached my table. This man seemed not well. He had so many layers of clothes on in the middle of the summer, and his hair was so long.  He was drooling uncontrollably, like a dog, a continuous flow of saliva going from his lips to into the depths of this Dumbledore beard thing.  I fiddled with my phone (thanks Angry Birds!) and pretended not to notice him, hoping he would go away.  Obviously he didn't.  Instead, he TOUCHED MY FACE.  His hands were disgusting (smelled like eggs and pickles blended together).  I wasn't sure what to do, and I was feeling uncomfortable, so I panicked and pushed him to the ground, then got out of there lickity split.\n\nI haven't been back since.  I think the management needs to step up and exercise some control about who they let in their store.  This man could have hurt me, or worse.  My father didn't fight in Iraq to have people like this infringing on my personal freedom.","date":"2012-08-24 16:34:32","vector":[0.0633111111,0.0,0.0,-0.12765,0.0]}
{"review_id":"iBsUciOqQK9czfXcTocZdA","user_id":"zBZZMRInIYN4ySM8QHAxZQ","business_id":"ayMyBuxLLifdptJd-FS4PA","stars":5,"text":"Lovely tour I dragged my four kids out to do. Once there they gained some appreciation for the history of JWR and the beauty of where he lived. Everything about the place is gorgeous.","date":"2016-10-30 13:21:52","vector":[0.0,0.0,0.7096,0.0,0.0]}
{"review_id":"5EAo0Bbp_imAVGDDBLmspg","user_id":"FuwGvsc8gQa5-QOJsWvyEg","business_id":"ayMyBuxLLifdptJd-FS4PA","stars":4,"text":"I had a great time at the James Whitcomb Riley House - and, to my delight, I got a private tour! We were greeted at the front door by a guide who showed us just the first floor before sending us upstairs to a second guide; we concluded with a third. All three guides were very friendly and knowledgeable. Now, I love house museums - and particularly authors' homes - and this one was fantastic. The house itself is very modest, especially considering how many people lived there, but it remains very intact to Riley's period. After the tour, I completely nerded out with a few of the staff there and chatted about poetry, literary tastes, and how we teach children about classic writing today. My only complaint, if it can be called that, is the road. Lockerbie Square is a beautiful and historic area, but I was not expecting the bumpy brick road - it was not kind to the car. The good news is that they have a little parking lot.\n\nAs I'm not an Indiana native, my own exposure to Riley was self-inflicted. I do enjoy his poetry and I was hoping they'd talk more specifically about his poems, maybe even recite one or two short ones. I mean, there are lots of historic homes with cool stuff in 'em, but not all of them can boast that Riley lived there!","date":"2011-12-10 16:44:37","vector":[-0.296,0.0,0.1655,0.1516833333,0.0]}
{"review_id":"4yar2eue3I_nye_-pnpMuA","user_id":"ButO6G4QnUsocTOMg1EzxA","business_id":"xJ3aziMabFEjF8X0kvPfLw","stars":4,"text":"I come here practically every single day for the daily double shot of espresso and a scone (for my boss, but sometimes for myself as well!) The espresso is great, the pastries are fresh, and the salads are really good for lunches. I'm not a huge fan of the sandwiches, as they tend to be pretty small for the price. At least the salads are a decent portion size! The soups are good too, they change consistently and I like the variety. Like I said, it IS pricey, but cheaper than Gia Pronto down the street, and this location is more convenient for my job. Not to mention, the staff members here are great!","date":"2015-07-22 19:44:38","vector":[0.3115333333,0.31245,0.0,0.0,0.0]}
